Repository: travel-bridge/excursions
Catalog: src/Excursions.Application/Resources/ExcursionResource.*.resx
Languages: ru_ru

# Domain:BookingApproveWhenNotBookedError
source: Booking can be approved when status is booked.
ru_ru: Бронирование может быть подтверждено только в статусе забронировано.

# Domain:BookingRejectWhenNotBookedError
source: Booking can be rejected when status is booked.
ru_ru: Бронирование может быть отклонено только в статусе забронировано.

# Domain:ExcursionUpdateWhenNotDraftError
source: Excursion can be updated when status is draft.
ru_ru: Экскурсия может быть изменена только в статусе черновик.

# Domain:ExcursionBookWhenNotPublishedError
source: Excursion can be booked when status is published.
ru_ru: Экскурсия может быть забронирована только в статусе опубликована.

# Domain:ExcursionBookPlacesCountLimitError
source: Excursion can be booked when excursion has places left.
ru_ru: Экскурсия может быть забронирована только когда есть свободные места.

# Validation:ExcursionDateTimeUtcNotDefaultError
source: Excursion date should not be empty.
ru_ru: Дата экскурсии не должна быть пустой.

# Validation:ExcursionDescriptionMaximumLengthError
source: Excursion description should be less than or equal to 512.
ru_ru: Описании экскурсии должно быть меньше или равно 512.

# Validation:ExcursionNameMaximumLengthError
source: Excursion name should be less than or equal to 64.
ru_ru: Название экскурсии должно быть меньше или равно 64.

# Validation:ExcursionNameNotEmptyError
source: Excursion name should not be empty.
ru_ru: Название экскурии не должно быть пустым.

# Validation:ExcursionPlacesCountGreaterThanError
source: Excursion places count should be greater than 0.
ru_ru: Количество мест экскурсии должно быть больше 0.

# Validation:ExcursionPlacesCountLessThanOrEqualToError
source: Excursion places count should be less than or equal to 10.
ru_ru: Количество мест экскурсии должно быть меньше или равно 10.

# Validation:ExcursionPricePerPlaceGreaterThanError
source: Excursion price per place should be greater than 0.
ru_ru: Цена за место экскурсии должна быть больше 0.

# Domain:ExcursionBookWhenTouristAlreadyBookedError
source: Excursion can be booked only once.
ru_ru: Экскурсия может быть забронирована только один раз.
